tutorials4NF/phaseChangeMaterial4NF/semiCicleMonoHeterogeneous/constant/nanoFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nanoFluidProperties;
}
//------------------------------- nanoFluid4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//--------------------------------------------------------------------------------------//


//************************************************ baseFluid ************************************************//
baseFluid			(aceticAcid);
moleFraction			(1.0);
#include "../../../materialsDict.H";
transportModel			Newtonian;


//************************************************ particle ************************************************//
particle			( (Cu MNP) );//(NEPCMTwo MNEPCM)
particleDict
{
    Cu
    {
        Components		(Cu);
        moleFraction		(1.0);
    }

    NEPCMTwo
    {
        MNEPCMCoreDict
        {
            Components		(n_Hexadecane);
            moleFraction	(1.0);
        }
        MNEPCMShellDict
        {
            Components		(polyurethane);
            moleFraction	(1.0);
        }
	d			10.0e-9;
	weightRatio		0.8;
    }
}


//************************************************ nanoFluid ************************************************//
nanoFluidModel			(mono Heterogeneous);//Heterogeneous-Homogenous
thermalConductivityModel	HamiltonCrosser;
HamiltonCrosserCoeffs
{
    lambda			3.0;
}

dynamicViscosityModel		Einstein;
EinsteinCoeffs{}


//***************** Heterogeneous *****************//
brownianDiffusivityModel	Brownian;
BrownianCoeffs
{
    dnp				(10.0e-9);
}

thermophoresisDiffusivityModel		McNabMeisen;
McNabMeisenCoeffs{}

//############################################### End #######################################################//
