tutorials4NF/phaseChangeMaterial4NF/semiCicleMonoHeterogeneous/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

nx	40;
ny	40;


R	0.5;
Rcos45 0.707106781;
Rsin45 0.707106781;
zLen	0.1;

vertices
(
    //-back
    (0 0 -0.1)//0
    (1.0 0 -0.1)//1
    (0 1.0 -0.1)//2
    (-1.0 0 -0.1)//3
    //-front
    (0 0 0.1)//4
    (1.0 0 0.1)//5
    (0 1.0 0.1)//6
    (-1.0 0 0.1)//7
);

blocks
(
    hex (0 1 2 0 4 5 6 4) ($nx $ny 1) simpleGrading (1 1 1)
    hex (0 2 3 0 4 6 7 4) ($nx $ny 1) simpleGrading (1 1 1)
);

edges
(
    //-back
    arc 1 2 (0.707106781 0.707106781 -0.1)
    arc 2 3 (-0.707106781 0.707106781 -0.1)
    //-front
    arc 5 6 (0.707106781 0.707106781 0.1)
    arc 6 7 (-0.707106781 0.707106781 0.1)
);

boundary
(
    semiCircle
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (2 3 7 6)
        );
    }


    horizontal
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 0 4 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 1 0)
            (0 3 2 0)
            (4 5 6 4)
            (4 6 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
